codecopy-bussiness-old-service/src/main/resources/mysql_deadlock_test/数据库事务并发测试-死锁问题-互斥锁相互等待.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="数据库事务并发测试-死锁问题" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">E:\Jmeter\apache-jmeter-4.0\apache-jmeter-4.0\bin\mysql-connector-java-6.0.2.jar</stringProp>
    </TestPlan>
    <hashTree>
      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="数据库连接配置" enabled="true">
        <boolProp name="autocommit">false</boolProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">lock_test</stringProp>
        <stringProp name="dbUrl">jdbc:mysql://localhost:3306/lock_test?autoReconnect=true&amp;serverTimezone=Asia/Shanghai&amp;allowMultiQueries=true</stringProp>
        <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="password">111</stringProp>
        <stringProp name="poolMax">20</stringProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="transactionIsolation">DEFAULT</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <stringProp name="username">root</stringProp>
        <boolProp name="preinit">true</boolProp>
      </JDBCDataSource>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="死锁：排他锁相互等待-线程组1" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">75</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="sql事务1" enabled="true">
          <stringProp name="dataSource">lock_test</stringProp>
          <stringProp name="queryType">Callable Statement</stringProp>
          <stringProp name="query">START TRANSACTION;

UPDATE t_lockdraw_money
SET money = money + 5
WHERE
	id = 3;

UPDATE t_lockdraw_money
SET money = money + 5
WHERE
	id = 4;

UPDATE t_lockdraw_money
SET money = money + 5
WHERE
	id = 5;


COMMIT;
</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="sql事务2" enabled="true">
          <stringProp name="dataSource">lock_test</stringProp>
          <stringProp name="queryType">Callable Statement</stringProp>
          <stringProp name="query">START TRANSACTION;

UPDATE t_lockdraw_money
SET money = money + 5
WHERE
	id = 4;

UPDATE t_lockdraw_money
SET money = money + 5
WHERE
	id = 3;

UPDATE t_lockdraw_money
SET money = money + 5
WHERE
	id = 5;


COMMIT;
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="用表格察看结果" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="死锁：排他锁相互等待-优化-线程组1" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="sql事务1" enabled="true">
          <stringProp name="dataSource">lock_test</stringProp>
          <stringProp name="queryType">Callable Statement</stringProp>
          <stringProp name="query">START TRANSACTION;
 
UPDATE t_lockdraw_money
SET money = CASE id
WHEN 3 THEN
    (money + 5)
WHEN 4 THEN
    (money + 5)
WHEN 5 THEN
    (money + 5)
END
WHERE
    id IN (3, 4, 5);
 
COMMIT;
</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="sql事务2" enabled="true">
          <stringProp name="dataSource">lock_test</stringProp>
          <stringProp name="queryType">Callable Statement</stringProp>
          <stringProp name="query">START TRANSACTION;
 
UPDATE t_lockdraw_money
SET money = CASE id
WHEN 3 THEN
    (money + 5)
WHEN 4 THEN
    (money + 5)
WHEN 5 THEN
    (money + 5)
END
WHERE
    id IN (4, 3, 5);
 
COMMIT;</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="用表格察看结果" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>